# vsoContextM_Add

## Description
Deprecated, use vsoContextM_AddN instead

```pascal
PROCEDURE vsoContextM_Add(
				locName : STRING;
				itemID  : INTEGER;
				helpID  : STRING);
```

```python

def vs.vsoContextM_Add(locName, itemID, helpID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|locName|STRING||
|itemID|INTEGER||
|helpID|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* Object Events